//#include <iostream>
//
//// 메인함수의 자료형은 현재 int(정수형)
//int main()
//{
//    int i; // 선언
//    i = 0; // 초기화 or 할당
//
//    //int i = 0; 선언과 초기화 동시에.
//    //for문
//    for (i=0; i<100 ; i++)
//    {
//        std::cout << i+1 << ". 안녕하세요\n";
//    }
//
//    std::cout << "--------------------\n";
//
//    for (i = 100; i > 0; i--)
//    {
//        std::cout << i << ". 안녕히가세요\n";
//    }
//
//    //while문
//    while (i < 100)
//    {
//        std::cout << i + 1 << ". 하위\n";
//        i++;
//    }
//
//
//    i = 100;
//    while (i != 0)
//    {
//        std::cout << i << ". 배윙\n";
//        i--;
//    }
//
//    i = 100;
//    do
//    {
//        std::cout << i << ". 두_배윙\n";
//        i--;
//    } while (i != 0);
//
//
//
//
//
//    return 0; // 0의 값을 반환
//}
